app/controllers/v1/events_controller.rb

    def index
      @events = Event.includes(:user).order(created_at: :desc)
---
SELECT "events".* FROM "events"  ORDER BY "events"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)